app/Controllers/BerandaSurat.php

    public function index()
    {
        $data = [
            'title' => 'SISUAR',
            'suratMasukWrn' => '#9DAB86  ',
            'suratKeluarWrn' => '#57837B',
            'suratTugasWrn' => '#FFD369',
            'btnPrimary' => '#874C62',
            'suratmasuk' => $this->SuratMasukModels->findAll(),
            'suratkeluar' => $this->SuratKeluarModels->findAll(),
            'surattugas' => $this->SuratTugasModels->findAll(),
            'jumlahSuratMasuk' => $this->SuratMasukModels->hitungSuratMasuk(),
            'jumlahSuratKeluar' => $this->SuratKeluarModels->hitungSuratKeluar(),
            'jumlahSuratTugas' => $this->SuratTugasModels->hitungSuratTugas()
        ];
---
SELECT *
FROM `surat_Tugas`
SELECT *
FROM `surat_keluar`
SELECT *
FROM `surat_masuk`