app/Controllers/SuratTugas.php

SELECT *
FROM `surat_Tugas`
---
    public function index()
    {
        $data = [
            'title' => 'SISUAR',
            'surattugas' => $this->SuratTugasModels->findAll(),

INSERT INTO `surat_Tugas` (`no_surat`, `asal_surat`, `tujuan_surat`, `perihal`, `tanggal_tugas`, `ket_surat`, `file`) VALUES ('BGG23', 'kalteng', 'Himkom', 'Proposal', '2022-09-15', 'Ya', '-')
---
    public function tambahSuratTugas()
    {
        $dataSuratTugas = [
            'no_surat' => $this->request->getVar('no_surat'),
            'asal_surat' => $this->request->getVar('asal_surat'),
            'tujuan_surat' => $this->request->getVar('tujuan_surat'),
            'perihal' => $this->request->getVar('perihal'),
            'tanggal_masuk' => $this->request->getVar('tanggal_masuk'),
            'ket_surat' => $this->request->getVar('ket_surat'),
            'file' => '-',
        ];
        $this->SuratTugasModels->save($dataSuratTugas);