app/Controllers/SuratMasuk.php

    public function index()
    {

        $id = $this->request->uri->getSegment(2);
        helper(['form', 'url']);
        $jumlahRecord = $this->SuratMasukModels->where('id_surat', $id)->countAllResults();

        $data = [
            'title' => 'SISUAR',
            'suratmasuk' => $this->SuratMasukModels->findAll(),
            'jumlahSuratMasuk' => $this->SuratMasukModels->hitungSuratMasuk(),
            'jumlahSuratKeluar' => $this->SuratKeluarModels->hitungSuratKeluar(),
            'jumlahSuratTugas' => $this->SuratTugasModels->hitungSuratTugas()
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `surat_masuk`
WHERE `id_surat` = ''
SELECT *
FROM `surat_masuk`