app/Models/DisposisiModels.php

SELECT *
FROM `disposisi`
WHERE `id_surat` = '29'
---
    public function getDisposisi($idSurat)
    {
        return $this->table('surat_masuk')->where('id_surat', $idSurat)->get();