app/Models/SuratMasukModels.php

    public function hitungSuratMasuk()
    {
        return $this->db->table('surat_masuk')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `surat_masuk`

    public function getOne($id)
    {
        return $this->where(['id_surat' => $id])->first();
---
SELECT *
FROM `surat_masuk`
WHERE `id_surat` = '29'
 LIMIT 1

    public function filterDate($tglmin, $tglmax)
    {
        return $this->table('surat_masuk')->where('tanggal_masuk >=', $tglmin)->where('tanggal_masuk <=', $tglmax)->get();
---
SELECT *
FROM `surat_masuk`
WHERE `tanggal_masuk` >= '2022-09-01'
AND `tanggal_masuk` <= '2022-09-15'