app/Models/SuratKeluarModels.php

    public function hitungSuratKeluar()
    {
        return $this->db->table('surat_Keluar')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `surat_Keluar`